<a href="https://colab.research.google.com/github/RudinP/SOLUX_Summer_data_study/blob/master/1%EC%A3%BC%EC%B0%A8/%EC%B1%95%ED%84%B06(0726).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
friends=[{'age':15,'job':'student'},
        {'age':25,'job':'developer'},
        {'age':30,'job':'teacher'}]
df=pd.DataFrame(friends, index=['John','Jenny','Nate'],
               columns=['age','job'])#index와 columns를 지정하여 데이터프레임 생성

In [ ]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [ ]:
df.drop(['John','Nate'])#john과 nate 인덱스의 해당줄을 삭제하고싶음

       age        job
Jenny   25  developer

In [ ]:
df=df.drop(['John','Nate'])#할당

In [ ]:
df

       age        job
Jenny   25  developer

In [ ]:
df=pd.DataFrame(friends, index=['John','Jenny','Nate'],
               columns=['age','job'])

In [ ]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [ ]:
df=pd.DataFrame(friends, index=['John','Jenny','Nate'],
               columns=['age','job'])

In [ ]:
df.drop(['John','Nate'],inplace=True)#drop한 value가 바로 적용되어 따로 assign 안해도 됨

In [ ]:
df

       age        job
Jenny   25  developer

In [ ]:
friends=[{'name':'John','age':15,'job':'student'},
        {'name':'Ben','age':25,'job':'developer'},
        {'name':'Jenny','age':30,'job':'teacher'}]
df=pd.DataFrame(friends, 
               columns=['name','age','job'])

In [ ]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
df = df.drop(df.index[[0,2]])#row의 index로 삭제

In [ ]:
df

  name  age        job
1  Ben   25  developer

In [ ]:
df=pd.DataFrame(friends, 
               columns=['name','age','job'])

In [ ]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
df=df[df.age>20]#age가 20이상인 것만 남기기(value에따른 drop)

In [ ]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
df=pd.DataFrame(friends, 
               columns=['name','age','job'])

In [ ]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
df =df.drop('age',axis=1)#column중에서 age를 드랍시켜라라는 의미

In [ ]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [ ]:
df=pd.DataFrame(friends, 
               columns=['name','age','job'])

In [ ]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
df.drop('age',axis=1,inplace=True)
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher